SH1_58mps/system/blockMeshDict

FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters     1;

vertices
(
    (0 -0.5 -0.5)
    (10 -0.5 -0.5)
    (10 0.5 -0.5)
    (0 0.5 -0.5)
    (0 -0.5 0.5)
    (10 -0.5 0.5)
    (10 0.5 0.5)
    (0 0.5 0.5)
);

blocks
(
    hex ( 0 1 2 3 4 5 6 7 ) (1000 1 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 7 3 0)
        );
    }
    backWall
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (2 3 7 6)
            (0 3 2 1)
            (0 4 5 1)
        );
    }
)

mergePatchPairs();
